analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixf_regs.h
#define MXC_F_SPIXF_CFG_HICLK_POS                      12 /**< CFG_HICLK Position */
#define MXC_F_SPIXF_CFG_HICLK                          ((uint32_t)(0xFUL << MXC_F_SPIXF_CFG_HICLK_POS)) /**< CFG_HICLK Mask */

#define MXC_F_SPIXF_CFG_SSACT_POS                      16 /**< CFG_SSACT Position */
#define MXC_F_SPIXF_CFG_SSACT                          ((uint32_t)(0x3UL << MXC_F_SPIXF_CFG_SSACT_POS)) /**< CFG_SSACT Mask */
#define MXC_V_SPIXF_CFG_SSACT_OFF                      ((uint32_t)0x0UL) /**< CFG_SSACT_OFF Value */
#define MXC_S_SPIXF_CFG_SSACT_OFF                      (MXC_V_SPIXF_CFG_SSACT_OFF << MXC_F_SPIXF_CFG_SSACT_POS) /**< CFG_SSACT_OFF Setting */
#define MXC_V_SPIXF_CFG_SSACT_2CLK                     ((uint32_t)0x1UL) /**< CFG_SSACT_2CLK Value */
#define MXC_S_SPIXF_CFG_SSACT_2CLK                     (MXC_V_SPIXF_CFG_SSACT_2CLK << MXC_F_SPIXF_CFG_SSACT_POS) /**< CFG_SSACT_2CLK Setting */
#define MXC_V_SPIXF_CFG_SSACT_4CLK                     ((uint32_t)0x2UL) /**< CFG_SSACT_4CLK Value */
#define MXC_S_SPIXF_CFG_SSACT_4CLK                     (MXC_V_SPIXF_CFG_SSACT_4CLK << MXC_F_SPIXF_CFG_SSACT_POS) /**< CFG_SSACT_4CLK Setting */
#define MXC_V_SPIXF_CFG_SSACT_8CLK                     ((uint32_t)0x3UL) /**< CFG_SSACT_8CLK Value */
#define MXC_S_SPIXF_CFG_SSACT_8CLK                     (MXC_V_SPIXF_CFG_SSACT_8CLK << MXC_F_SPIXF_CFG_SSACT_POS) /**< CFG_SSACT_8CLK Setting */

#define MXC_F_SPIXF_CFG_SSIACT_POS                     18 /**< CFG_SSIACT Position */
#define MXC_F_SPIXF_CFG_SSIACT                         ((uint32_t)(0x3UL << MXC_F_SPIXF_CFG_SSIACT_POS)) /**< CFG_SSIACT Mask */
#define MXC_V_SPIXF_CFG_SSIACT_1CLK                    ((uint32_t)0x0UL) /**< CFG_SSIACT_1CLK Value */
#define MXC_S_SPIXF_CFG_SSIACT_1CLK                    (MXC_V_SPIXF_CFG_SSIACT_1CLK << MXC_F_SPIXF_CFG_SSIACT_POS) /**< CFG_SSIACT_1CLK Setting */
#define MXC_V_SPIXF_CFG_SSIACT_3CLK                    ((uint32_t)0x1UL) /**< CFG_SSIACT_3CLK Value */
#define MXC_S_SPIXF_CFG_SSIACT_3CLK                    (MXC_V_SPIXF_CFG_SSIACT_3CLK << MXC_F_SPIXF_CFG_SSIACT_POS) /**< CFG_SSIACT_3CLK Setting */
#define MXC_V_SPIXF_CFG_SSIACT_5CLK                    ((uint32_t)0x2UL) /**< CFG_SSIACT_5CLK Value */
#define MXC_S_SPIXF_CFG_SSIACT_5CLK                    (MXC_V_SPIXF_CFG_SSIACT_5CLK << MXC_F_SPIXF_CFG_SSIACT_POS) /**< CFG_SSIACT_5CLK Setting */
#define MXC_V_SPIXF_CFG_SSIACT_9CLK                    ((uint32_t)0x3UL) /**< CFG_SSIACT_9CLK Value */
#define MXC_S_SPIXF_CFG_SSIACT_9CLK                    (MXC_V_SPIXF_CFG_SSIACT_9CLK << MXC_F_SPIXF_CFG_SSIACT_POS) /**< CFG_SSIACT_9CLK Setting */

/**@} end of group SPIXF_CFG_Register */

/**
 * @ingroup  spixf_registers
 * @defgroup SPIXF_FETCH_CTRL SPIXF_FETCH_CTRL
 * @brief    SPIX Fetch Control Register.
 * @{
 */
#define MXC_F_SPIXF_FETCH_CTRL_CMDVAL_POS              0 /**< FETCH_CTRL_CMDVAL Position */
#define MXC_F_SPIXF_FETCH_CTRL_CMDVAL                  ((uint32_t)(0xFFUL << MXC_F_SPIXF_FETCH_CTRL_CMDVAL_POS)) /**< FETCH_CTRL_CMDVAL Mask */

#define MXC_F_SPIXF_FETCH_CTRL_CMDWTH_POS              8 /**< FETCH_CTRL_CMDWTH Position */
#define MXC_F_SPIXF_FETCH_CTRL_CMDWTH                  ((uint32_t)(0x3UL << MXC_F_SPIXF_FETCH_CTRL_CMDWTH_POS)) /**< FETCH_CTRL_CMDWTH Mask */
#define MXC_V_SPIXF_FETCH_CTRL_CMDWTH_MONO             ((uint32_t)0x0UL) /**< FETCH_CTRL_CMDWTH_MONO Value */
#define MXC_S_SPIXF_FETCH_CTRL_CMDWTH_MONO             (MXC_V_SPIXF_FETCH_CTRL_CMDWTH_MONO << MXC_F_SPIXF_FETCH_CTRL_CMDWTH_POS) /**< FETCH_CTRL_CMDWTH_MONO Setting */
#define MXC_V_SPIXF_FETCH_CTRL_CMDWTH_DUAL             ((uint32_t)0x1UL) /**< FETCH_CTRL_CMDWTH_DUAL Value */
#define MXC_S_SPIXF_FETCH_CTRL_CMDWTH_DUAL             (MXC_V_SPIXF_FETCH_CTRL_CMDWTH_DUAL << MXC_F_SPIXF_FETCH_CTRL_CMDWTH_POS) /**< FETCH_CTRL_CMDWTH_DUAL Setting */
#define MXC_V_SPIXF_FETCH_CTRL_CMDWTH_QUAD             ((uint32_t)0x2UL) /**< FETCH_CTRL_CMDWTH_QUAD Value */
#define MXC_S_SPIXF_FETCH_CTRL_CMDWTH_QUAD             (MXC_V_SPIXF_FETCH_CTRL_CMDWTH_QUAD << MXC_F_SPIXF_FETCH_CTRL_CMDWTH_POS) /**< FETCH_CTRL_CMDWTH_QUAD Setting */
#define MXC_V_SPIXF_FETCH_CTRL_CMDWTH_INVALID          ((uint32_t)0x3UL) /**< FETCH_CTRL_CMDWTH_INVALID Value */
#define MXC_S_SPIXF_FETCH_CTRL_CMDWTH_INVALID          (MXC_V_SPIXF_FETCH_CTRL_CMDWTH_INVALID << MXC_F_SPIXF_FETCH_CTRL_CMDWTH_POS) /**< FETCH_CTRL_CMDWTH_INVALID Setting */

#define MXC_F_SPIXF_FETCH_CTRL_ADDR_WIDTH_POS          10 /**< FETCH_CTRL_ADDR_WIDTH Position */
#define MXC_F_SPIXF_FETCH_CTRL_ADDR_WIDTH              ((uint32_t)(0x3UL << MXC_F_SPIXF_FETCH_CTRL_ADDR_WIDTH_POS)) /**< FETCH_CTRL_ADDR_WIDTH Mask */
#define MXC_V_SPIXF_FETCH_CTRL_ADDR_WIDTH_SINGLE       ((uint32_t)0x0UL) /**< FETCH_CTRL_ADDR_WIDTH_SINGLE Value */
#define MXC_S_SPIXF_FETCH_CTRL_ADDR_WIDTH_SINGLE       (MXC_V_SPIXF_FETCH_CTRL_ADDR_WIDTH_SINGLE << MXC_F_SPIXF_FETCH_CTRL_ADDR_WIDTH_POS) /**< FETCH_CTRL_ADDR_WIDTH_SINGLE Setting */
#define MXC_V_SPIXF_FETCH_CTRL_ADDR_WIDTH_DUAL         ((uint32_t)0x1UL) /**< FETCH_CTRL_ADDR_WIDTH_DUAL Value */
#define MXC_S_SPIXF_FETCH_CTRL_ADDR_WIDTH_DUAL         (MXC_V_SPIXF_FETCH_CTRL_ADDR_WIDTH_DUAL << MXC_F_SPIXF_FETCH_CTRL_ADDR_WIDTH_POS) /**< FETCH_CTRL_ADDR_WIDTH_DUAL Setting */
#define MXC_V_SPIXF_FETCH_CTRL_ADDR_WIDTH_QUAD         ((uint32_t)0x2UL) /**< FETCH_CTRL_ADDR_WIDTH_QUAD Value */
#define MXC_S_SPIXF_FETCH_CTRL_ADDR_WIDTH_QUAD         (MXC_V_SPIXF_FETCH_CTRL_ADDR_WIDTH_QUAD << MXC_F_SPIXF_FETCH_CTRL_ADDR_WIDTH_POS) /**< FETCH_CTRL_ADDR_WIDTH_QUAD Setting */
#define MXC_V_SPIXF_FETCH_CTRL_ADDR_WIDTH_INVALID      ((uint32_t)0x3UL) /**< FETCH_CTRL_ADDR_WIDTH_INVALID Value */
#define MXC_S_SPIXF_FETCH_CTRL_ADDR_WIDTH_INVALID      (MXC_V_SPIXF_FETCH_CTRL_ADDR_WIDTH_INVALID << MXC_F_SPIXF_FETCH_CTRL_ADDR_WIDTH_POS) /**< FETCH_CTRL_ADDR_WIDTH_INVALID Setting */

#define MXC_F_SPIXF_FETCH_CTRL_DATA_WIDTH_POS          12 /**< FETCH_CTRL_DATA_WIDTH Position */
#define MXC_F_SPIXF_FETCH_CTRL_DATA_WIDTH              ((uint32_t)(0x3UL << MXC_F_SPIXF_FETCH_CTRL_DATA_WIDTH_POS)) /**< FETCH_CTRL_DATA_WIDTH Mask */
#define MXC_V_SPIXF_FETCH_CTRL_DATA_WIDTH_SINGLE       ((uint32_t)0x0UL) /**< FETCH_CTRL_DATA_WIDTH_SINGLE Value */
#define MXC_S_SPIXF_FETCH_CTRL_DATA_WIDTH_SINGLE       (MXC_V_SPIXF_FETCH_CTRL_DATA_WIDTH_SINGLE << MXC_F_SPIXF_FETCH_CTRL_DATA_WIDTH_POS) /**< FETCH_CTRL_DATA_WIDTH_SINGLE Setting */
#define MXC_V_SPIXF_FETCH_CTRL_DATA_WIDTH_DUAL         ((uint32_t)0x1UL) /**< FETCH_CTRL_DATA_WIDTH_DUAL Value */
#define MXC_S_SPIXF_FETCH_CTRL_DATA_WIDTH_DUAL         (MXC_V_SPIXF_FETCH_CTRL_DATA_WIDTH_DUAL << MXC_F_SPIXF_FETCH_CTRL_DATA_WIDTH_POS) /**< FETCH_CTRL_DATA_WIDTH_DUAL Setting */
#define MXC_V_SPIXF_FETCH_CTRL_DATA_WIDTH_QUAD         ((uint32_t)0x2UL) /**< FETCH_CTRL_DATA_WIDTH_QUAD Value */
#define MXC_S_SPIXF_FETCH_CTRL_DATA_WIDTH_QUAD         (MXC_V_SPIXF_FETCH_CTRL_DATA_WIDTH_QUAD << MXC_F_SPIXF_FETCH_CTRL_DATA_WIDTH_POS) /**< FETCH_CTRL_DATA_WIDTH_QUAD Setting */
#define MXC_V_SPIXF_FETCH_CTRL_DATA_WIDTH_INVALID      ((uint32_t)0x3UL) /**< FETCH_CTRL_DATA_WIDTH_INVALID Value */
#define MXC_S_SPIXF_FETCH_CTRL_DATA_WIDTH_INVALID      (MXC_V_SPIXF_FETCH_CTRL_DATA_WIDTH_INVALID << MXC_F_SPIXF_FETCH_CTRL_DATA_WIDTH_POS) /**< FETCH_CTRL_DATA_WIDTH_INVALID Setting */

#define MXC_F_SPIXF_FETCH_CTRL_ADDR4_POS               16 /**< FETCH_CTRL_ADDR4 Position */
#define MXC_F_SPIXF_FETCH_CTRL_ADDR4                   ((uint32_t)(0x1UL << MXC_F_SPIXF_FETCH_CTRL_ADDR4_POS)) /**< FETCH_CTRL_ADDR4 Mask */
#define MXC_V_SPIXF_FETCH_CTRL_ADDR4_3BYTE             ((uint32_t)0x0UL) /**< FETCH_CTRL_ADDR4_3BYTE Value */
#define MXC_S_SPIXF_FETCH_CTRL_ADDR4_3BYTE             (MXC_V_SPIXF_FETCH_CTRL_ADDR4_3BYTE << MXC_F_SPIXF_FETCH_CTRL_ADDR4_POS) /**< FETCH_CTRL_ADDR4_3BYTE Setting */
#define MXC_V_SPIXF_FETCH_CTRL_ADDR4_4BYTE             ((uint32_t)0x1UL) /**< FETCH_CTRL_ADDR4_4BYTE Value */
#define MXC_S_SPIXF_FETCH_CTRL_ADDR4_4BYTE             (MXC_V_SPIXF_FETCH_CTRL_ADDR4_4BYTE << MXC_F_SPIXF_FETCH_CTRL_ADDR4_POS) /**< FETCH_CTRL_ADDR4_4BYTE Setting */

/**@} end of group SPIXF_FETCH_CTRL_Register */

/**
 * @ingroup  spixf_registers
 * @defgroup SPIXF_MODE_CTRL SPIXF_MODE_CTRL
 * @brief    SPIX Mode Control Register.
 * @{
 */
#define MXC_F_SPIXF_MODE_CTRL_MDCLK_POS                0 /**< MODE_CTRL_MDCLK Position */
#define MXC_F_SPIXF_MODE_CTRL_MDCLK                    ((uint32_t)(0xFUL << MXC_F_SPIXF_MODE_CTRL_MDCLK_POS)) /**< MODE_CTRL_MDCLK Mask */

