analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixf_regs.h
#define MXC_F_SPIXF_MODE_CTRL_NOCMD_POS                8 /**< MODE_CTRL_NOCMD Position */
#define MXC_F_SPIXF_MODE_CTRL_NOCMD                    ((uint32_t)(0x1UL << MXC_F_SPIXF_MODE_CTRL_NOCMD_POS)) /**< MODE_CTRL_NOCMD Mask */
#define MXC_V_SPIXF_MODE_CTRL_NOCMD_ALWAYS             ((uint32_t)0x0UL) /**< MODE_CTRL_NOCMD_ALWAYS Value */
#define MXC_S_SPIXF_MODE_CTRL_NOCMD_ALWAYS             (MXC_V_SPIXF_MODE_CTRL_NOCMD_ALWAYS << MXC_F_SPIXF_MODE_CTRL_NOCMD_POS) /**< MODE_CTRL_NOCMD_ALWAYS Setting */
#define MXC_V_SPIXF_MODE_CTRL_NOCMD_ONCE               ((uint32_t)0x1UL) /**< MODE_CTRL_NOCMD_ONCE Value */
#define MXC_S_SPIXF_MODE_CTRL_NOCMD_ONCE               (MXC_V_SPIXF_MODE_CTRL_NOCMD_ONCE << MXC_F_SPIXF_MODE_CTRL_NOCMD_POS) /**< MODE_CTRL_NOCMD_ONCE Setting */

#define MXC_F_SPIXF_MODE_CTRL_MODE_SEND_POS            9 /**< MODE_CTRL_MODE_SEND Position */
#define MXC_F_SPIXF_MODE_CTRL_MODE_SEND                ((uint32_t)(0x1UL << MXC_F_SPIXF_MODE_CTRL_MODE_SEND_POS)) /**< MODE_CTRL_MODE_SEND Mask */
#define MXC_V_SPIXF_MODE_CTRL_MODE_SEND_NEXT           ((uint32_t)0x1UL) /**< MODE_CTRL_MODE_SEND_NEXT Value */
#define MXC_S_SPIXF_MODE_CTRL_MODE_SEND_NEXT           (MXC_V_SPIXF_MODE_CTRL_MODE_SEND_NEXT << MXC_F_SPIXF_MODE_CTRL_MODE_SEND_POS) /**< MODE_CTRL_MODE_SEND_NEXT Setting */

/**@} end of group SPIXF_MODE_CTRL_Register */

/**
 * @ingroup  spixf_registers
 * @defgroup SPIXF_MODE_DATA SPIXF_MODE_DATA
 * @brief    SPIX Mode Data Register.
 * @{
 */
#define MXC_F_SPIXF_MODE_DATA_MDDATA_POS               0 /**< MODE_DATA_MDDATA Position */
#define MXC_F_SPIXF_MODE_DATA_MDDATA                   ((uint32_t)(0xFFFFUL << MXC_F_SPIXF_MODE_DATA_MDDATA_POS)) /**< MODE_DATA_MDDATA Mask */

#define MXC_F_SPIXF_MODE_DATA_MDOE_POS                 16 /**< MODE_DATA_MDOE Position */
#define MXC_F_SPIXF_MODE_DATA_MDOE                     ((uint32_t)(0xFFFFUL << MXC_F_SPIXF_MODE_DATA_MDOE_POS)) /**< MODE_DATA_MDOE Mask */

/**@} end of group SPIXF_MODE_DATA_Register */

/**
 * @ingroup  spixf_registers
 * @defgroup SPIXF_FB_CTRL SPIXF_FB_CTRL
 * @brief    SPIX Feedback Control Register.
 * @{
 */
#define MXC_F_SPIXF_FB_CTRL_FBMD_POS                   0 /**< FB_CTRL_FBMD Position */
#define MXC_F_SPIXF_FB_CTRL_FBMD                       ((uint32_t)(0x1UL << MXC_F_SPIXF_FB_CTRL_FBMD_POS)) /**< FB_CTRL_FBMD Mask */
#define MXC_V_SPIXF_FB_CTRL_FBMD_DIS                   ((uint32_t)0x0UL) /**< FB_CTRL_FBMD_DIS Value */
#define MXC_S_SPIXF_FB_CTRL_FBMD_DIS                   (MXC_V_SPIXF_FB_CTRL_FBMD_DIS << MXC_F_SPIXF_FB_CTRL_FBMD_POS) /**< FB_CTRL_FBMD_DIS Setting */
#define MXC_V_SPIXF_FB_CTRL_FBMD_EN                    ((uint32_t)0x1UL) /**< FB_CTRL_FBMD_EN Value */
#define MXC_S_SPIXF_FB_CTRL_FBMD_EN                    (MXC_V_SPIXF_FB_CTRL_FBMD_EN << MXC_F_SPIXF_FB_CTRL_FBMD_POS) /**< FB_CTRL_FBMD_EN Setting */

#define MXC_F_SPIXF_FB_CTRL_FBINV_POS                  1 /**< FB_CTRL_FBINV Position */
#define MXC_F_SPIXF_FB_CTRL_FBINV                      ((uint32_t)(0x1UL << MXC_F_SPIXF_FB_CTRL_FBINV_POS)) /**< FB_CTRL_FBINV Mask */
#define MXC_V_SPIXF_FB_CTRL_FBINV_DIS                  ((uint32_t)0x0UL) /**< FB_CTRL_FBINV_DIS Value */
#define MXC_S_SPIXF_FB_CTRL_FBINV_DIS                  (MXC_V_SPIXF_FB_CTRL_FBINV_DIS << MXC_F_SPIXF_FB_CTRL_FBINV_POS) /**< FB_CTRL_FBINV_DIS Setting */
#define MXC_V_SPIXF_FB_CTRL_FBINV_EN                   ((uint32_t)0x1UL) /**< FB_CTRL_FBINV_EN Value */
#define MXC_S_SPIXF_FB_CTRL_FBINV_EN                   (MXC_V_SPIXF_FB_CTRL_FBINV_EN << MXC_F_SPIXF_FB_CTRL_FBINV_POS) /**< FB_CTRL_FBINV_EN Setting */

/**@} end of group SPIXF_FB_CTRL_Register */

/**
 * @ingroup  spixf_registers
 * @defgroup SPIXF_IO_CTRL SPIXF_IO_CTRL
 * @brief    SPIX IO Control Register.
 * @{
 */
#define MXC_F_SPIXF_IO_CTRL_SCK_DS_POS                 0 /**< IO_CTRL_SCK_DS Position */
#define MXC_F_SPIXF_IO_CTRL_SCK_DS                     ((uint32_t)(0x1UL << MXC_F_SPIXF_IO_CTRL_SCK_DS_POS)) /**< IO_CTRL_SCK_DS Mask */
#define MXC_V_SPIXF_IO_CTRL_SCK_DS_LOW                 ((uint32_t)0x0UL) /**< IO_CTRL_SCK_DS_LOW Value */
#define MXC_S_SPIXF_IO_CTRL_SCK_DS_LOW                 (MXC_V_SPIXF_IO_CTRL_SCK_DS_LOW << MXC_F_SPIXF_IO_CTRL_SCK_DS_POS) /**< IO_CTRL_SCK_DS_LOW Setting */
#define MXC_V_SPIXF_IO_CTRL_SCK_DS_HIGH                ((uint32_t)0x1UL) /**< IO_CTRL_SCK_DS_HIGH Value */
#define MXC_S_SPIXF_IO_CTRL_SCK_DS_HIGH                (MXC_V_SPIXF_IO_CTRL_SCK_DS_HIGH << MXC_F_SPIXF_IO_CTRL_SCK_DS_POS) /**< IO_CTRL_SCK_DS_HIGH Setting */

#define MXC_F_SPIXF_IO_CTRL_SS_DS_POS                  1 /**< IO_CTRL_SS_DS Position */
#define MXC_F_SPIXF_IO_CTRL_SS_DS                      ((uint32_t)(0x1UL << MXC_F_SPIXF_IO_CTRL_SS_DS_POS)) /**< IO_CTRL_SS_DS Mask */
#define MXC_V_SPIXF_IO_CTRL_SS_DS_LOW                  ((uint32_t)0x0UL) /**< IO_CTRL_SS_DS_LOW Value */
#define MXC_S_SPIXF_IO_CTRL_SS_DS_LOW                  (MXC_V_SPIXF_IO_CTRL_SS_DS_LOW << MXC_F_SPIXF_IO_CTRL_SS_DS_POS) /**< IO_CTRL_SS_DS_LOW Setting */
#define MXC_V_SPIXF_IO_CTRL_SS_DS_HIGH                 ((uint32_t)0x1UL) /**< IO_CTRL_SS_DS_HIGH Value */
#define MXC_S_SPIXF_IO_CTRL_SS_DS_HIGH                 (MXC_V_SPIXF_IO_CTRL_SS_DS_HIGH << MXC_F_SPIXF_IO_CTRL_SS_DS_POS) /**< IO_CTRL_SS_DS_HIGH Setting */

#define MXC_F_SPIXF_IO_CTRL_SDIO_DS_POS                2 /**< IO_CTRL_SDIO_DS Position */
#define MXC_F_SPIXF_IO_CTRL_SDIO_DS                    ((uint32_t)(0x1UL << MXC_F_SPIXF_IO_CTRL_SDIO_DS_POS)) /**< IO_CTRL_SDIO_DS Mask */
#define MXC_V_SPIXF_IO_CTRL_SDIO_DS_LOW                ((uint32_t)0x0UL) /**< IO_CTRL_SDIO_DS_LOW Value */
#define MXC_S_SPIXF_IO_CTRL_SDIO_DS_LOW                (MXC_V_SPIXF_IO_CTRL_SDIO_DS_LOW << MXC_F_SPIXF_IO_CTRL_SDIO_DS_POS) /**< IO_CTRL_SDIO_DS_LOW Setting */
#define MXC_V_SPIXF_IO_CTRL_SDIO_DS_HIGH               ((uint32_t)0x1UL) /**< IO_CTRL_SDIO_DS_HIGH Value */
#define MXC_S_SPIXF_IO_CTRL_SDIO_DS_HIGH               (MXC_V_SPIXF_IO_CTRL_SDIO_DS_HIGH << MXC_F_SPIXF_IO_CTRL_SDIO_DS_POS) /**< IO_CTRL_SDIO_DS_HIGH Setting */

#define MXC_F_SPIXF_IO_CTRL_PUPDCTRL_POS               3 /**< IO_CTRL_PUPDCTRL Position */
#define MXC_F_SPIXF_IO_CTRL_PUPDCTRL                   ((uint32_t)(0x3UL << MXC_F_SPIXF_IO_CTRL_PUPDCTRL_POS)) /**< IO_CTRL_PUPDCTRL Mask */
#define MXC_V_SPIXF_IO_CTRL_PUPDCTRL_TRI_STATE         ((uint32_t)0x0UL) /**< IO_CTRL_PUPDCTRL_TRI_STATE Value */
#define MXC_S_SPIXF_IO_CTRL_PUPDCTRL_TRI_STATE         (MXC_V_SPIXF_IO_CTRL_PUPDCTRL_TRI_STATE << MXC_F_SPIXF_IO_CTRL_PUPDCTRL_POS) /**< IO_CTRL_PUPDCTRL_TRI_STATE Setting */
#define MXC_V_SPIXF_IO_CTRL_PUPDCTRL_PULL_UP           ((uint32_t)0x1UL) /**< IO_CTRL_PUPDCTRL_PULL_UP Value */
#define MXC_S_SPIXF_IO_CTRL_PUPDCTRL_PULL_UP           (MXC_V_SPIXF_IO_CTRL_PUPDCTRL_PULL_UP << MXC_F_SPIXF_IO_CTRL_PUPDCTRL_POS) /**< IO_CTRL_PUPDCTRL_PULL_UP Setting */
#define MXC_V_SPIXF_IO_CTRL_PUPDCTRL_PULL_DOWN         ((uint32_t)0x2UL) /**< IO_CTRL_PUPDCTRL_PULL_DOWN Value */
#define MXC_S_SPIXF_IO_CTRL_PUPDCTRL_PULL_DOWN         (MXC_V_SPIXF_IO_CTRL_PUPDCTRL_PULL_DOWN << MXC_F_SPIXF_IO_CTRL_PUPDCTRL_POS) /**< IO_CTRL_PUPDCTRL_PULL_DOWN Setting */

/**@} end of group SPIXF_IO_CTRL_Register */

/**
 * @ingroup  spixf_registers
 * @defgroup SPIXF_SEC_CTRL SPIXF_SEC_CTRL
 * @brief    SPIX Memory Security Control Register.
 * @{
 */
#define MXC_F_SPIXF_SEC_CTRL_DEC_EN_POS                0 /**< SEC_CTRL_DEC_EN Position */
#define MXC_F_SPIXF_SEC_CTRL_DEC_EN                    ((uint32_t)(0x1UL << MXC_F_SPIXF_SEC_CTRL_DEC_EN_POS)) /**< SEC_CTRL_DEC_EN Mask */
#define MXC_V_SPIXF_SEC_CTRL_DEC_EN_DIS                ((uint32_t)0x0UL) /**< SEC_CTRL_DEC_EN_DIS Value */
#define MXC_S_SPIXF_SEC_CTRL_DEC_EN_DIS                (MXC_V_SPIXF_SEC_CTRL_DEC_EN_DIS << MXC_F_SPIXF_SEC_CTRL_DEC_EN_POS) /**< SEC_CTRL_DEC_EN_DIS Setting */
#define MXC_V_SPIXF_SEC_CTRL_DEC_EN_EN                 ((uint32_t)0x1UL) /**< SEC_CTRL_DEC_EN_EN Value */
#define MXC_S_SPIXF_SEC_CTRL_DEC_EN_EN                 (MXC_V_SPIXF_SEC_CTRL_DEC_EN_EN << MXC_F_SPIXF_SEC_CTRL_DEC_EN_POS) /**< SEC_CTRL_DEC_EN_EN Setting */

#define MXC_F_SPIXF_SEC_CTRL_AUTH_DISABLE_POS          1 /**< SEC_CTRL_AUTH_DISABLE Position */
#define MXC_F_SPIXF_SEC_CTRL_AUTH_DISABLE              ((uint32_t)(0x1UL << MXC_F_SPIXF_SEC_CTRL_AUTH_DISABLE_POS)) /**< SEC_CTRL_AUTH_DISABLE Mask */
#define MXC_V_SPIXF_SEC_CTRL_AUTH_DISABLE_EN           ((uint32_t)0x0UL) /**< SEC_CTRL_AUTH_DISABLE_EN Value */
#define MXC_S_SPIXF_SEC_CTRL_AUTH_DISABLE_EN           (MXC_V_SPIXF_SEC_CTRL_AUTH_DISABLE_EN << MXC_F_SPIXF_SEC_CTRL_AUTH_DISABLE_POS) /**< SEC_CTRL_AUTH_DISABLE_EN Setting */
#define MXC_V_SPIXF_SEC_CTRL_AUTH_DISABLE_DIS          ((uint32_t)0x1UL) /**< SEC_CTRL_AUTH_DISABLE_DIS Value */
#define MXC_S_SPIXF_SEC_CTRL_AUTH_DISABLE_DIS          (MXC_V_SPIXF_SEC_CTRL_AUTH_DISABLE_DIS << MXC_F_SPIXF_SEC_CTRL_AUTH_DISABLE_POS) /**< SEC_CTRL_AUTH_DISABLE_DIS Setting */

/**@} end of group SPIXF_SEC_CTRL_Register */

/**
 * @ingroup  spixf_registers
 * @defgroup SPIXF_BUS_IDLE SPIXF_BUS_IDLE
 * @brief    Bus Idle
 * @{
 */
#define MXC_F_SPIXF_BUS_IDLE_BUSIDLE_POS               0 /**< BUS_IDLE_BUSIDLE Position */
#define MXC_F_SPIXF_BUS_IDLE_BUSIDLE                   ((uint32_t)(0xFFFFUL << MXC_F_SPIXF_BUS_IDLE_BUSIDLE_POS)) /**< BUS_IDLE_BUSIDLE Mask */

/**@} end of group SPIXF_BUS_IDLE_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_SPIXF_REGS_H_
